app/Config/Globals.php

SELECT *
FROM `themes`
SELECT *
FROM `general_settings`
WHERE `id` = 1
SELECT *
FROM `routes`
SELECT *
FROM `roles_permissions`
SELECT *
FROM `languages`
WHERE `status` = 1
SELECT *
FROM `languages`
WHERE `id` = '1'
---
    public static function setGlobals()
    {
        // Database Connection
        self::$db = \Config\Database::connect();
        $session = \Config\Services::session();
        //set themes
        self::$themes = self::$db->table('themes')->get()->getResult();
        //set general settings
        self::$generalSettings = self::$db->table('general_settings')->where('id', 1)->get()->getRow();
        //set routes
        $routes = self::$db->table('routes')->get()->getResult();
        self::$customRoutes = new \stdClass();
        if (!empty($routes)) {
            foreach ($routes as $route) {
                $routeKey = $route->route_key;
                self::$customRoutes->$routeKey = $route->route;
            }
        }

        // var_dump(self::$customRoutes);

        //set roles permissions
        self::$rolesPermissions = self::$db->table('roles_permissions')->get()->getResult();
        //set languages
        self::$languages = self::$db->table('languages')->where('status', 1)->get()->getResult();
        //set timezone
        if (!empty(self::$generalSettings->timezone)) {
            date_default_timezone_set(self::$generalSettings->timezone);
        }
        //set active language
        self::$defaultLang = self::$db->table('languages')->where('id', self::$generalSettings->site_lang)->get()->getRow();

SELECT *
FROM `settings`
WHERE `lang_id` = '1'
---
            self::$langBaseUrl = base_url();
        }
        //set settings
        self::$settings = self::$db->table('settings')->where('lang_id', self::$activeLang->id)->get()->getRow();

SELECT `users`.*, `role_name`, `permissions`, `is_super_admin`, `is_admin`, `is_vendor`, `is_member`
FROM `users`
JOIN `roles_permissions` ON `roles_permissions`.`id` = `users`.`role_id`
WHERE `users`.`id` = 1
---
        //authentication
        if (!empty($session->get('min_ses_id')) && !empty($session->get('min_ses_role_id')) && !empty($session->get('min_ses_pass'))) {

            $user = self::$db->table('users')
                ->join('roles_permissions', 'roles_permissions.id = users.role_id')
                ->where('users.id', cleanNumber($session->get('min_ses_id')))
                ->select('users.*, role_name, permissions, is_super_admin, is_admin, is_vendor, is_member')
                ->get()
                ->getRow();

SELECT *
FROM `language_translations`
WHERE `lang_id` = '1'
---
    public static function setActiveLanguage($langId)
    {
        if (!empty(self::$languages)) {
            foreach (self::$languages as $lang) {
                if ($langId == $lang->id) {
                    self::$activeLang = $lang;
                    //set language translations
                    self::$languageTranslations = self::$db->table('language_translations')->where('lang_id', self::$activeLang->id)->get()->getResult();