app/Models/AuthModel.php

    public function updateLastSeen()
    {
        if (authCheck()) {
            $this->builder->where('id', user()->id)->update(['last_seen' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_seen` = '2024-07-27 01:44:55'
WHERE `id` = '1'