app/Models/PageModel.php

    public function getPageByDefaultName($defaultName, $langId)
    {
        return $this->builder->where('page_default_name', cleanStr($defaultName))->where('lang_id', cleanNumber($langId))->get()->getRow();
---
SELECT *
FROM `pages`
WHERE `page_default_name` = 'contact'
AND `lang_id` = 1